TurbulanceModels-flat-plate/k-wSST/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4e-07;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 4e-07;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 4e-07;
    }

    plate
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    top
    {
        type            freestream;
        freestreamValue uniform 4e-07;
    }

    front
    {
        type            symmetryPlane;
        freestreamValue uniform 4e-07;
    }
}

// ************************************************************************* //
