TurbulanceModels-flat-plate/k-wSST/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet          800;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 800;
    }
    plate
    {
        type            omegaWallFunction;
        value           $omegaInlet;
    }
    front
    {
        type            symmetryPlane;
    }
    top 
    {
        type            freestream;
        freestreamValue uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
