TurbulanceModels-flat-plate/k-wSST/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .01;

vertices        
(
    (-20 0 0) //0     Back face
    (0 0 0) //1
    (0 100 0) //2
    (-20 100 0) //3
    (80 0 0) //4
    (80 100 0) //5
    (-20 0 0.1) //6     Front face
    (0 0 0.1) //7
    (0 100 0.1) //8
    (-20 100 0.1) //9
    (80 0 0.1) //10
    (80 100 0.1) //11

);

blocks          
(
    hex (0 1 2 3 6 7 8 9) (20 100 1) simpleGrading (1 235 1) //block 0
    hex (1 4 5 2 7 10 11 8) (80 100 1) simpleGrading (1 235 1) //block 1
);

edges           
(
);

boundary         
(
    inlet 
    {
     type patch;
     faces
     (
        (3 0 6 9)
      );
    }
    outlet
    {
     type patch;
     faces
    (
        (4 5 11 10)
     );
    }
    top 
    {
     type patch;
     faces
    (
        (2 3 9 8)
        (2 8 11 5)
    );
    }
    plate
    {
     type wall;
     faces
    (
        (1 4 10 7)
    );
    }
    front
    {
     type     symmetryPlane;
     faces
       (
        (0 1 7 6)
    );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
